In [1]:
import pandas as pd
import numpy as np

In [4]:
s=pd.Series(['Ahis',1,5,'a',np.nan])
s

0    Ahis
1       1
2       5
3       a
4     NaN
dtype: object

In [7]:
dates=pd.date_range("20210209",periods=8)
dates

DatetimeIndex(['2021-02-09', '2021-02-10', '2021-02-11', '2021-02-12',
               '2021-02-13', '2021-02-14', '2021-02-15', '2021-02-16'],
              dtype='datetime64[ns]', freq='D')

In [8]:
l=list("ABCDES")
l

['A', 'B', 'C', 'D', 'E', 'S']

In [10]:
df=pd.DataFrame(np.random.randn(8,6),index=dates,columns=l)
df

                   A         B         C         D         E         S
2021-02-09 -1.336043  0.751131  2.950094 -0.615325 -0.892601  0.362832
2021-02-10 -0.592038 -1.129578 -1.967518  0.667316  0.221464  0.553907
2021-02-11  0.726727  0.753325 -0.712634 -0.981569  0.971021  0.431699
2021-02-12 -1.880649 -0.408679  1.145119  0.734094 -0.092416 -0.431831
2021-02-13  0.564371 -1.751207 -0.510168 -1.419576  0.574982  2.323791
2021-02-14  1.265879 -0.823476 -0.576619  0.983464  0.715875 -1.718613
2021-02-15  0.695961 -0.571965 -1.214169 -0.161218 -0.033389 -1.129449
2021-02-16  1.762454  0.642529  0.178551 -0.205127 -0.329924  0.053915

In [12]:
pd.Timestamp("20200304")

Timestamp('2020-03-04 00:00:00')

In [27]:
a=np.array([1,2,3,5])
pd.Series(a,index=range(4),dtype='float32')

0    1.0
1    2.0
2    3.0
3    5.0
dtype: float32

In [29]:
[3]*4

[3, 3, 3, 3]

In [30]:
df=pd.DataFrame(
    {
        
                  "A": 1.0,
            "B": pd.Timestamp("20130102"),
            "C": pd.Series(1, index=list(range(4)), dtype="float32"),
             "D": np.array([3] * 4, dtype="int32"),
            "E": pd.Categorical(["test", "train", "test", "train"]),
             "F": "foo",
    }
               )
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [32]:
df.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [37]:
df=df.set_index('B')

In [38]:
df.index

DatetimeIndex(['2013-01-02', '2013-01-02', '2013-01-02', '2013-01-02'], dtype='datetime64[ns]', name='B', freq=None)

In [39]:
df.columns

Index(['A', 'C', 'D', 'E', 'F'], dtype='object')

In [40]:
df.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [41]:
df[0:3]

              A    C  D      E    F
B
2013-01-02  1.0  1.0  3   test  foo
2013-01-02  1.0  1.0  3  train  foo
2013-01-02  1.0  1.0  3   test  foo

In [46]:
df.loc["20130102"]

              A    C  D      E    F
B
2013-01-02  1.0  1.0  3   test  foo
2013-01-02  1.0  1.0  3  train  foo
2013-01-02  1.0  1.0  3   test  foo
2013-01-02  1.0  1.0  3  train  foo

In [48]:
df.iloc[1:3,1:4]

              C  D      E
B
2013-01-02  1.0  3  train
2013-01-02  1.0  3   test

In [51]:
df[df["E"]=="test"]

              A    C  D     E    F
B
2013-01-02  1.0  1.0  3  test  foo
2013-01-02  1.0  1.0  3  test  foo

In [53]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range("20210304",periods=6))
s1

2021-03-04    1
2021-03-05    2
2021-03-06    3
2021-03-07    4
2021-03-08    5
2021-03-09    6
Freq: D, dtype: int64

In [54]:
df["F"]=s1

In [59]:
df.loc[:, "D"] = np.array([5] * len(df))

In [60]:
df

              A    C  D      E   F
B
2013-01-02  1.0  1.0  5   test NaN
2013-01-02  1.0  1.0  5  train NaN
2013-01-02  1.0  1.0  5   test NaN
2013-01-02  1.0  1.0  5  train NaN

In [61]:
df.mean(1)#row wise

B
2013-01-02    2.333333
2013-01-02    2.333333
2013-01-02    2.333333
2013-01-02    2.333333
dtype: float64

In [66]:
#histogramming
s=pd.Series(np.random.randint(0,7,size=10))#Random integer between size 0 and 7
s

0    2
1    6
2    0
3    2
4    2
5    5
6    3
7    1
8    0
9    3
dtype: int32

In [67]:
s.value_counts()

2    3
3    2
0    2
6    1
5    1
1    1
dtype: int64

In [68]:
#String methods
s=pd.Series(["A","B","c",np.nan,"Bcas","CABA","dog"])
s

0       A
1       B
2       c
3     NaN
4    Bcas
5    CABA
6     dog
dtype: object

In [70]:
s.str.lower()

0       a
1       b
2       c
3     NaN
4    bcas
5    caba
6     dog
dtype: object

In [71]:
df=pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  1.008076 -0.002922 -0.519131  0.349423
1  0.457377 -0.368489 -0.591926  0.410063
2 -0.073401  0.279437  0.613421 -0.831966
3  0.725991  0.237687 -0.113636 -0.732874
4 -1.187848  0.954313  0.528681 -1.329560
5  0.384147  1.688464  0.463063 -2.114463
6  0.381204 -0.535946 -1.210938 -0.786862
7 -0.930435  0.726609  1.380180  0.750963
8 -0.707470  0.677374  0.357970 -1.587424
9 -1.079707 -0.496763  0.688309  1.318415

In [72]:
pieces=[df[:3],df[3:7],df[7:]]#First 3 rows then next 4 rows and then last 3 rows

In [73]:
pd.concat(pieces)

          0         1         2         3
0  1.008076 -0.002922 -0.519131  0.349423
1  0.457377 -0.368489 -0.591926  0.410063
2 -0.073401  0.279437  0.613421 -0.831966
3  0.725991  0.237687 -0.113636 -0.732874
4 -1.187848  0.954313  0.528681 -1.329560
5  0.384147  1.688464  0.463063 -2.114463
6  0.381204 -0.535946 -1.210938 -0.786862
7 -0.930435  0.726609  1.380180  0.750963
8 -0.707470  0.677374  0.357970 -1.587424
9 -1.079707 -0.496763  0.688309  1.318415

<b>Applying SQL querries</b>

In [2]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [3]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [4]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [5]:
df=pd.DataFrame({
    "A":["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
    "B":["one", "one", "two", "three", "two", "two", "one", "three"],
    "C":np.random.randn(8),
    "D":np.random.randn(8)
})
df

     A      B         C         D
0  foo    one  0.911823  1.228041
1  bar    one  2.418678  2.033089
2  foo    two  0.837457 -0.312528
3  bar  three -0.646284  0.965225
4  foo    two  0.625708 -0.628223
5  bar    two -0.067860  0.941955
6  foo    one -1.245727  0.510242
7  foo  three -0.645255  0.034010

In [7]:
df.groupby("A").sum()

            C         D
A
bar  1.704534  3.940269
foo  0.484006  0.831543

In [8]:
df.groupby(["A","B"]).sum()

                  C         D
A   B
bar one    2.418678  2.033089
    three -0.646284  0.965225
    two   -0.067860  0.941955
foo one   -0.333904  1.738284
    three -0.645255  0.034010
    two    1.463165 -0.940751

In [12]:
a=("Abhs","Ayu","Vij")
b=("Pune","Bang","Chenn")
x=zip(*[a,b])
list(x)

[('Abhs', 'Pune'), ('Ayu', 'Bang'), ('Vij', 'Chenn')]

In [14]:
#In python, * is the 'splat' operator. It is used for unpacking a list into arguments.

In [15]:
tuples=list(
        zip(*
            [
                ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
                ["one", "two", "one", "two", "one", "two", "one", "two"]
            ]
           )
        )

In [16]:
df=pd.DataFrame(
{
    "A": ["one", "one", "two", "three"] * 3,
    "B": ["A", "B", "C"] * 4,
    "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
    "D": np.random.randn(12),
    "E": np.random.randn(12)
})

In [17]:
df

        A  B    C         D         E
0     one  A  foo -0.962157 -0.688054
1     one  B  foo -1.146673  0.061888
2     two  C  foo  0.531795 -0.327687
3   three  A  bar -0.758101 -0.574175
4     one  B  bar -0.556607  2.685096
5     one  C  bar  0.626065 -1.145181
6     two  A  foo -0.442907 -0.083466
7   three  B  foo -0.260708 -1.048027
8     one  C  foo  0.331443 -1.332519
9     one  A  bar -2.119990 -0.446514
10    two  B  bar -1.075716  0.035114
11  three  C  bar  0.631607  1.147044

In [20]:
#A Pivot Table is used to summarise, sort, reorganise, group, count, total or average data stored in a table. 
#It allows us to transform columns into rows and rows into columns. It allows grouping by any field (column), 
#and using advanced calculations on them.

In [21]:
pd.pivot_table(df,values="D",index=["A","B"],columns=["C"])

C             bar       foo
A     B
one   A -2.119990 -0.962157
      B -0.556607 -1.146673
      C  0.626065  0.331443
three A -0.758101       NaN
      B       NaN -0.260708
      C  0.631607       NaN
two   A       NaN -0.442907
      B -1.075716       NaN
      C       NaN  0.531795

In [30]:
rng=pd.date_range("1/1/2020",periods=100,freq="4H")
#rng
#freq M->month end frequenct
# S->seconds
#4H->hourly frequency

In [31]:
ts=pd.Series(np.random.randint(0,500,len(rng)),index=rng)

In [36]:
ts.resample("5Min").sum()

2020-01-01 00:00:00    287
2020-01-01 00:05:00      0
2020-01-01 00:10:00      0
2020-01-01 00:15:00      0
2020-01-01 00:20:00      0
                      ...
2020-01-17 11:40:00      0
2020-01-17 11:45:00      0
2020-01-17 11:50:00      0
2020-01-17 11:55:00      0
2020-01-17 12:00:00    326
Freq: 5T, Length: 4753, dtype: int32

In [48]:
#Categorical
df=pd.DataFrame(
{
    "id":[1,2,3,4,5,6],
    "raw_grade":["a","b","b","a","a","e"]#dtype object
})

In [49]:
df["grade"]=df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [50]:
df["grade"].cat.categories=["very good","good","very bad"]
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [47]:
#df["grade"]=df["grade"].cat.set_categories(["very bad","bad","medium","good","very good"])
#df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [51]:
df.sort_values(by="grade")

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

In [52]:
df.groupby("grade").size()

grade
very good    3
good         2
very bad     1
dtype: int64